lvx/base/InformationRegisters/бит_му_СоставПериметровКонсолидации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_му_СоставПериметровКонсолидации</Name>
			<Comment>(БИТ МУ)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКонсолидации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_ТипыКонсолидации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолнаяДоляВладения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляНеконтролирующихАкционеров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодКонсолидации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_МетодыКонсолидации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсуществляетКонтрольПериметра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериметрКонсолидации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_му_ПериметрыКонсолидации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/InformationRegisters/бит_му_СоставПериметровКонсолидации/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;	
	КонецЕсли; 	
	
	// Проверим нет ли записей по периметру консолидации в будущих периодах.
	СтрокаСообщения = "";
	
	ТабЗнач = ЭтотОбъект.Выгрузить();
	ТабЗнач.Свернуть("Период, ПериметрКонсолидации");
	
	Для каждого ТекСтр Из ТабЗнач Цикл
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_му_СоставПериметровКонсолидации.Период КАК Период
		|ИЗ
		|	РегистрСведений.бит_му_СоставПериметровКонсолидации КАК бит_му_СоставПериметровКонсолидации
		|ГДЕ
		|	бит_му_СоставПериметровКонсолидации.Период > &Период
		|	И бит_му_СоставПериметровКонсолидации.ПериметрКонсолидации = &ПериметрКонсолидации
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_му_СоставПериметровКонсолидации.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		
		Запрос.УстановитьПараметр("Период"			 	, ТекСтр.Период);
		Запрос.УстановитьПараметр("ПериметрКонсолидации", ТекСтр.ПериметрКонсолидации);
		
		Выборка = Запрос.Выполнить().Выбрать();		
		Пока Выборка.Следующий() Цикл
			ШаблонСообщения = НСтр("ru = '-""%1"" период %2'; en = '-""%1"" period %2'");
			СтрокаСообщения = СтрокаСообщения + Символы.ПС + 
				СтрШаблон(ШаблонСообщения, ТекСтр.ПериметрКонсолидации, Формат(Выборка.Период, "ДЛФ=D"));
		КонецЦикла;
		
	КонецЦикла;
	
	Если СтрокаСообщения <> "" Тогда
		СтрокаСообщения = НСтр("ru='Найдены записи в будущих периодах для периметров консолидации:';
							   |en='Records found in future periods for the consolidation perimeteres:'") 
						  + СтрокаСообщения;
		ОбщегоНазначения.СообщитьПользователю(СтрокаСообщения);
	КонецЕсли;
	
	
	СтрокаСообщения = "";	
	Для каждого ТекСтр Из ЭтотОбъект Цикл
		// Проверка на наличие записей, где дата окончания меньше периода.
		Если ЗначениеЗаполнено(ТекСтр.ДатаОкончания) И (ТекСтр.ДатаОкончания < ТекСтр.Период) Тогда
			ШаблонСообщения = НСтр("ru = '-""%1"" период %2, дата окончания %3'; 
								   |en = '-""%1"" period %2, expiration date %3'");
			СтрокаСообщения = СтрокаСообщения + Символы.ПС + 
				СтрШаблон(ШаблонСообщения, ТекСтр.ПериметрКонсолидации, 
						  Формат(ТекСтр.Период, "ДЛФ=D"), Формат(ТекСтр.ДатаОкончания, "ДЛФ=D"));
		КонецЕсли;		
	КонецЦикла;
	
	Если СтрокаСообщения <> "" Тогда
		СтрокаСообщения = НСтр("ru='Найдены записи, дата окончания которых меньше даты начала, для периметров консолидации:';
							   |en='Records found, which end date is earlier than start date, for the consolidation perimeters:'") 
						  + СтрокаСообщения;
		ОбщегоНазначения.СообщитьПользователю(СтрокаСообщения, , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
